# Используем официальный образ Node.js для создания контейнера
FROM node:14

# Устанавливаем директорию приложения внутри контейнера
WORKDIR /app

# Копируем файлы package.json и package-lock.json для установки зависимостей
COPY package*.json ./

# Устанавливаем зависимости приложения
RUN npm ci

# Копируем все файлы вашего приложения внутрь контейнера
COPY . .
ENV PORT=3000

# Здесь можно добавить дополнительные команды, необходимые для запуска вашего приложения, например, выполнение сборки
# Если для вашего телеграм-бота требуются дополнительные зависимости, вы можете установить их здесь.

EXPOSE $PORT
# Команда для запуска вашего приложения
CMD ["npm", "start"]
